[{
    "title": "Solution Architect in Smart Manufacturing Solutions",
    "time": "Dec 2021 - Present",
    "organization": "Hexagon (MSC Software Corporation India Pvt. Ltd)",
    "points": [
        "Lead architect for Technical Design of Industry 4.0 solutions for manufacturing segment customers.",
        "Designed solutions on integrating entreprise wide quality management systems for the leading Indian automotive/ICE manufacturers.",
        "Deployment of concept-proof on WhatsApp-query & notificiation services with the customer MES-system for critical asset monitoring."
    ]
},
{
    "title": "Lead Technial Architect in Entreprise Solutions",
    "time": "Jan 2020 - Nov 2021",
    "organization": "Just Finance (JFin India)",
    "points": [
        "Leading the Technical Design and Dev-Ops team in the organization.",
        "Established strategy of Kubernetes-clusters for inhouse feature development and cloud based web services.",
        "Deployment of payment gateway service for customers.",
        "Creating data processing pipelines for creating machine learning system of credit allocation to customer base."
    ]
},
{
    "title": "Associate Manager in Project Engineering.",
    "time": "July 2017 - Dec 2019",
    "organization": "HeroMotoCorp Ltd (earlier Hero Honda Ltd)",
    "points": [
        "Created framework for Industry 4.0 production environment for greenfield manufacturing facility to achieve first smart factory in two-wheeler production industry.",
        "Project Lead over 50+ team members(including international partners) for the deployment of 'Central Manufacturing Cockpit' in greenfield plant.",
        "Lead the AI Initiative for manufacturing facilities at Hero.",
        "Part of the core team to lead the implementation of Enterprise Digital transformation.",
        "Delivered an application to automate the monthly production planning to increase the demand fulfillment by 2% at volumes of 8.3 million."
    ]
},
{
    "title": "Deputy Manager in Project Engineering",
    "time": "July 2014 - July 2017",
    "organization": "HeroMotoCorp Ltd ",
    "points": [
        "Established a greenfield automated warehouse to deliver 10X productivity from operations of two-wheeler spare parts business.",
        "Lead the CFT team to manage the engineering workflow to bring '6' new models to mass production process as part of new model development."
    ]
},
{
    "title": "Assistant Manager in Project Engineering",
    "time": "July 2011 - July 2014",
    "organization": "HeroMotoCorp Ltd ",
    "points": [
        "Project lead to transfer the 70+ inhouse process to existing supply chain partners",
        "Responsibility of creating & maintaining the cost structures of inhouse manufacturing processes for input to manufacturing strategy.",
        "Project lead to conduct value engineering to reduce the inhouse manufacturing cost by 6% for two export models."
    ]
}
]
